code-review/NRB_3471_3546/База_Стало/DataProcessors/TEST_ФормированиеОтчетовНРД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>TEST_ФормированиеОтчетовНРД</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТехОперация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТехническаяОперация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИстекСрокИсполненияПоручения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/ВходящийПакетИзФайловогоШлюза.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВходящийПакетИзФайловогоШлюза</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОстаткиПоЦеннымБумагамНРД</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТехническаяОперация</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий1024</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолныйПуть</Name>
					<Comment>Полный путь каталога сохранения файлов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтносительныйПуть</Name>
					<Comment>Относительный путь каталога сохранения файлов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовФайловыйШлюз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьАрхив</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработанMulti</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторныйОтчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СодержимоеФайла</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиФайла</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Элемент</Name>
							<Comment>Имя элемента или атрибута</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Comment>Значение элемента или атрибута</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Длина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/DataProcessors/TEST_ФормированиеОтчетовНРД/Forms/Форма/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура СформироватьКПакет(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ТехОперация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не выбрана техническая операция!");
		Возврат;
	КонецЕсли;
	
	ПараметрыПакета = Новый Структура;
	ПараметрыПакета.Вставить("ИмяФайла", ИмяФайлаКПакета);
	ПараметрыПакета.Вставить("reg_no", РегНомерТехОперации);
	ПараметрыПакета.Вставить("reg_date", РегДатаТехОперации);
	
	СформироватьКПакетНаСервере(ПараметрыПакета);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьZПакет(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ТехОперация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Выберите техническую операцию!");
		Возврат;
	КонецЕсли;
	
	Если СтрДлина(ИмяКаталогаZПакета) <> 8 Или Лев(ИмяКаталогаZПакета, 1) <> "Z" Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Имя каталога Z-пакета должно состоять из 8 символов в формате:"
			+ " ZDDMNNNN, где NNNN - номер поручения Депо на инвент.операцию");
		Возврат;
	КонецЕсли;
	
	Если СтрДлина(НомерОтчетаНРД) <> 8 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Номер отчета НРД должен состоять из 8 символов в формате:"
			+ " DDMYNNNN, где Y - номер исполнения, NNNN - номер поручения Депо на инвент.операцию");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаОтчетаНРД) Или Не ЗначениеЗаполнено(ДатаИсполненияВДепозитарииМХ)
		Или Не ЗначениеЗаполнено(ДатаИсполненияВМестеРасчетов) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Заполните все даты.");
		Возврат;
	КонецЕсли;
	
	Если Количество = 0 И isReportFormGS036 = Ложь Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Укажите количество.");
		Возврат;
	КонецЕсли;

	ПараметрыПакета = Новый Структура;
	ПараметрыПакета.Вставить("ИмяКаталога", ИмяКаталогаZПакета);
	ПараметрыПакета.Вставить("НомерОтчетаНРД", НомерОтчетаНРД);
	ПараметрыПакета.Вставить("ДатаОтчетаНРД", ДатаОтчетаНРД);
	ПараметрыПакета.Вставить("ДатаИсполненияВДепозитарииМХ", ДатаИсполненияВДепозитарииМХ);
	ПараметрыПакета.Вставить("ДатаИсполненияВМестеРасчетов", ДатаИсполненияВМестеРасчетов);
	ПараметрыПакета.Вставить("Количество", Количество);
	ПараметрыПакета.Вставить("ПричинаОтмены", ПричинаОтмены);
	ПараметрыПакета.Вставить("ВидБлокировки", ВидБлокировки);
	ПараметрыПакета.Вставить("GS036", isReportFormGS036);
	ПараметрыПакета.Вставить("TextMessageGS036", TextMessageGS036);
	
	СформироватьZПакетНаСервере(ПараметрыПакета);

КонецПроцедуры

&НаКлиенте
Процедура ФормированиеВыпискиНРД(Команда)

	Если Не ЗначениеЗаполнено(Объект.ТехОперация) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не выбрана техническая операция!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КаталогФайловОтветаНРД_API) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не определен каталог файлов ответа НРД API");
		Возврат;
	КонецЕсли;
	
	ПараметрыОперации = Новый Структура;	
	ПараметрыОперации.Вставить("Дата", ДатаОперации);
	ПараметрыОперации.Вставить("Сумма", Сумма);
	ПараметрыОперации.Вставить("Валюта", Валюта);
	ПараметрыОперации.Вставить("ИмяФайла", ИмяФайла);
	ПараметрыОперации.Вставить("ИДПлатежа", ПрефиксСделки_DNSD_CNSD(НаправлениеСделки) + Формат(ИДПлатежа, "ЧГ"));
	ПараметрыОперации.Вставить("Покупка", НаправлениеСделки);
	ПараметрыОперации.Вставить("КаталогФайловОтветаНРД_API", КаталогФайловОтветаНРД_API);
	
	ФормированиеВыпискиНРДнаСервере(ПараметрыОперации);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ТехОперацияПриИзменении(Элемент)
	ТехОперацияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	 ИмяФайла = "#PMRPT" + Формат(ТекущаяДата(),"ДФ=ddMMyyyy") + СлучайныйНомер(7);
	
 КонецПроцедуры
 
 &НаКлиенте
Процедура КаталогФайловОтветаНРД_APIНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	КаталогФайловОтветаНРД_API = ИмяКаталогаФайловОтветаНРД_API();	
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаКПакетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Номер = СлучайныйНомерФайлаКПакета();
	ИмяФайлаКПакета = Лев(Номер, 8);
	РегНомерТехОперации = Сред(Номер, 2, 8);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяКаталогаZПакетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИмяКаталогаZПакета = "Z" + КодДняМесяца(ДатаОтчетаНРД) + Лев(НомерИсполнения, 1) + Прав(НомерПорученияДепоНаИнвентОперацию, 3);
	УстановитьНомерОтчетаНРД();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерОтчетаНРДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УстановитьНомерОтчетаНРД();
		
КонецПроцедуры

&НаКлиенте
Процедура ИДПлатежаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИДПлатежа = ИДПлатежа();	
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяКаталогаZПакетаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ИмяКаталогаZПакета) тогда
		ОткрытьПапкуНаПросмотр(ПредопределенноеЗначение("ПланВидовХарактеристик.ВнешниеИсточники.ФайловыйШлюзКаталогВходящие"), ИмяКаталогаZПакета);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогФайловОтветаНРД_APIОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(КаталогФайловОтветаНРД_API) тогда
		ОткрытьПапкуНаПросмотр(КаталогФайловОтветаНРД_API);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаКПакетаОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(ИмяФайлаКПакета) тогда
		ОткрытьПапкуНаПросмотр(ПредопределенноеЗначение("ПланВидовХарактеристик.ВнешниеИсточники.ФайловыйШлюзКаталогВходящие"), ИмяФайлаКПакета);
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервереБезКонтекста
Функция ИмяКаталогаФайловОтветаНРД_API()
	
	Бэк = ВнешниеДанные.ОткрытьСоединениеСВнешнейБазой(ПланыВидовХарактеристик.ВнешниеИсточники.БэкОфис);
	НатройкаОбмена = Бэк.ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(Бэк.ПланыВидовХарактеристик.ВнешниеИсточники.КаталогФайловОтветаНРД);
	Если Не ЗначениеЗаполнено(НатройкаОбмена.Папка) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат НатройкаОбмена.Папка;
	
КонецФункции

&НаСервереБезКонтекста
Функция ИДПлатежа()

	УИН = "";
	Бэк = ВнешниеДанные.ОткрытьСоединениеСВнешнейБазой(ПланыВидовХарактеристик.ВнешниеИсточники.БэкОфис);
		
	ЧислоПопыток = 9999;
	НомерПопытки = 0;
	Пока Истина Цикл
		
		УИН = СлучайныйНомер(8);
		
		Если КодВыпискиУникальный(Бэк, УИН) тогда
			Прервать;
		КонецЕсли;
		
		НомерПопытки = НомерПопытки + 1;
		Если НомерПопытки > ЧислоПопыток тогда
			ВызватьИсключение "Неудача при подборе нового кода файла К";
		КонецЕсли;
			        		
	КонецЦикла;
	
	Возврат УИН;
	
КонецФункции

&НаСервереБезКонтекста
Функция КодВыпискиУникальный(Бэк, Код)
	
	Запрос = Бэк.NewObject("Запрос");
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	0 КАК Поле1
	|ИЗ
	|	РегистрСведений.ОперацииПоВыплатеДохода КАК ОперацииПоВыплатеДохода
	|ГДЕ
	|	ОперацииПоВыплатеДохода.ИДПлатежа = &ИДПлатежа";
	
	Запрос.Установитьпараметр("ИДПлатежа", Код);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

&НаСервере
Процедура ФормированиеВыпискиНРДнаСервере(ПараметрыОперации)

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ИмяФайла = ОбработкаОбъект.ИмяСформированногоФайлаВыписки(ПараметрыОперации);
	
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		ТекстСообщения = "Сформирован файл: " + ИмяФайла;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьКПакетНаСервере(ПараметрыПакета)
	
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.ФайловыйШлюзКаталогВходящие;
	ПараметрыВнешнегоИсточника = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник);
	
	Если Не ЗначениеЗаполнено(ПараметрыВнешнегоИсточника) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Не заполнены параметры внешнего источника %1", ВнешнийИсточник);
		ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ИмяФайла = ОбработкаОбъект.ИмяСформированногоФайлаKПакета(ПараметрыПакета);
	
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		ТекстСообщения = "Сформирован файл: " + ИмяФайла;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьZПакетНаСервере(ПараметрыПакета)
	
	ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.ФайловыйШлюзКаталогВходящие;
	ПараметрыВнешнегоИсточника = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(ВнешнийИсточник);
	
	Если Не ЗначениеЗаполнено(ПараметрыВнешнегоИсточника) Тогда
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку("Не заполнены параметры внешнего источника %1", ВнешнийИсточник);
		ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки);
		Возврат;
	КонецЕсли;
		
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");	
	ИмяФайла = ОбработкаОбъект.ИмяСформированногоАрхиваZПакета(ПараметрыПакета);
	
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		ТекстСообщения = "Сформирован файл: " + ИмяФайла;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция УстановитьНомерОтчетаНРД()
	
	НомерОтчетаНРД = КодДняМесяца(ДатаОтчетаНРД) + Лев(НомерИсполнения, 1) + Лев(НомерПорученияДепоНаИнвентОперацию, 4);
	
КонецФункции

&НаСервере
Функция НомерФайлаКПакетаУникальный(Код)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	0 КАК Поле1
	               |ИЗ
	               |	Документ.ВходящийПакетИзФайловогоШлюза КАК ВходящийПакетИзФайловогоШлюза
	               |ГДЕ
	               |	ВходящийПакетИзФайловогоШлюза.ОтносительныйПуть = &ОтносительныйПуть
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	0 КАК Поле1
	               |ИЗ
	               |	Документ.ТехническаяОперация КАК ТехническаяОперация
	               |ГДЕ
	               |	ТехническаяОперация.РегистрационныйНомер = &РегистрационныйНомер";
	
	Запрос.УстановитьПараметр("ОтносительныйПуть", Лев(Код,8));
	Запрос.УстановитьПараметр("РегистрационныйНомер", Сред(Код,2));
	Результат = Запрос.ВыполнитьПакет();
	Возврат Результат[0].Пустой() и Результат[1].Пустой();
	
КонецФункции

&НаСервере
Функция СлучайныйНомерФайлаКПакета()
	
	Преф = "K" + КодДняМесяца();
	ЧислоПопыток = 9999;
	НомерПопытки = 0;
	Пока Истина Цикл
		
		Код = Преф + СлучайныйНомер(6);
		
		Если НомерФайлаКПакетаУникальный(Код) тогда
			Прервать;
		КонецЕсли;
		
		НомерПопытки = НомерПопытки + 1;
		Если НомерПопытки > ЧислоПопыток тогда
			ВызватьИсключение "Неудача при подборе нового кода файла К";
		КонецЕсли;
		
		Код = "";
			        		
	КонецЦикла;
	
	Возврат Код;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПрефиксСделки_DNSD_CNSD(ЭтоПокупка)
	Возврат ?(ЭтоПокупка, "DNSD", "CNSD")
КонецФункции

// Возвращает день-месяц в виде строки из трех символов: ДДМ, где М - шестнадцатеричное число
//
// Параметры:
//  Д	 - Дата	 - если Неопределено, то берется текущая дата
// 
// Возвращаемое значение:
//  Строка - трехзначный код дня-месяца
//
&НаКлиентеНаСервереБезКонтекста
Функция КодДняМесяца(Д = Неопределено)
	
	Если Д = Неопределено Тогда
		Д = ТекущаяДата();
	КонецЕсли;
	Возврат Формат(День(Д), "ЧЦ=2; ЧВН=") + Сред("123456789ABC", Месяц(Д), 1);
	
КонецФункции

&НаКлиенте
Процедура ОткрытьПапкуНаПросмотр(Источник, имяПапки = "")
	
	Если ТипЗнч(Источник) = тип("Строка") Тогда
		КорневаяПапка = Источник;
	Иначе
		Настройик = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(Источник);
		КорневаяПапка = Настройик.Папка;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(КорневаяПапка) тогда
		
		Если ЗначениеЗаполнено(имяПапки) тогда
			КорневаяПапка = КорневаяПапка + "/" + имяПапки;
		КонецЕсли;
		
		ЗапуститьПриложение(КорневаяПапка);
		
	КонецЕсли;
	
КонецПроцедуры

&наСервереБезКонтекста
Функция СлучайныйНомер(Длина)
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	СлучайноеЧисло = ГСЧ.СлучайноеЧисло(pow(10, Длина - 1), pow(10, Длина) - 1);
	Возврат Лев(Формат(СлучайноеЧисло, "ЧГ="), Длина);
КонецФункции

&НаКлиенте
Процедура ДатаОтчетаНРДПриИзменении(Элемент)
	ДатаИсполненияВДепозитарииМХ = ДатаОтчетаНРД;
	ДатаИсполненияВМестеРасчетов = ДатаОтчетаНРД;
КонецПроцедуры

&НаСервере
Процедура ТехОперацияПриИзмененииНаСервере()
	
	НомерПоручения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ТехОперация, "НомерДокументаОснования");
	Номер = "0";
	Для Н = 1 По СтрДлина(НомерПоручения) Цикл
		Символ = Сред(НомерПоручения, Н, 1);
		Если Найти("0123456789", Символ) > 0 Тогда
			Номер = Номер + Символ;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;
	НомерПорученияДепоНаИнвентОперацию = Формат(Число(Номер), "ЧЦ=4; ЧВН=; ЧГ=");
	
	НомерИсполнения = "1";
КонецПроцедуры

&НаКлиенте
Процедура ИДПлатежа1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ИДПлатежа = ИДПлатежа();
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьПереводДС(Команда)
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.ТехОперация) Тогда
		ТекстОшибки = "Не выбрана техническая операция";
		ОбщегоНазначения.СообщитьОбОшибке(ТекстОшибки, Отказ);
	КонецЕсли;
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
		
	ФормированиеПодтвержлениеОперацииДС();
КонецПроцедуры

&НаСервере
Процедура ФормированиеПодтвержлениеОперацииДС()			
	ПараметрыОперации = Новый Структура("НомерБанковскогоСчета, НомерТранзитногоСчета, Сумма, Валюта",
		НомерБанковскогоСчета, НомерТранзитногоСчета, Сумма, Валюта);
	ПараметрыОперации.Вставить("ИмяФайла", ИмяФайла);
	ПараметрыОперации.Вставить("КаталогФайловОтветаНРД_API", КаталогФайловОтветаНРД_API);
	ПараметрыОперации.Вставить("ИДПлатежа", ИДПлатежа);
	ПараметрыОперации.Вставить("Дата", ДатаОперации);
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");	
	ИмяСформированногоФайла = ОбработкаОбъект.СформироватьПодтвержлениеОперацииДС(ПараметрыОперации);
	
	Если ЗначениеЗаполнено(ИмяСформированногоФайла) Тогда
		ТекстСообщения = "Сформирован файл: " + ИмяСформированногоФайла;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВидБлокировки = "Нет";
КонецПроцедуры
